import { useGetPostsApiQuery } from "@/redux/service/api/postsApi";
import fakeImage1 from "../../../assets/fake-post/fake-post-1.jpg";
import fakeImage2 from "../../../assets/fake-post/fake-post-2.jpg";
import fakeImage3 from "../../../assets/fake-post/fake-post-3.jpg";
import fakeUser1 from "../../../assets/fake-user-1.jpg";
import fakeUser2 from "../../../assets/fake-user-2.jpg";
import fakeUser3 from "../../../assets/fake-user-3.jpg";
import TimelinePost from "../utils/TimelinePost";

const TimelinePosts = () => {
      const { isError, isLoading, isSuccess, data } = useGetPostsApiQuery();
      const timeLinePosts = [
            {     
                  "_id": 1,
                  "userPhoto": fakeUser1,
                  "userName": "Sheikh Mamun",
                  "post": "হক সাহেবের সাথে ২০১৮ সালে সর্বপ্রথম গেঞ্জাম লাগছিলাম। শিখবে সবাইতে আমাদের ভুলবাল কোর্স করিয়ে টাকা হাতিয়ে নিয়েছিলেন। আমি একা গেঞ্জাম করেছিলাম সব তখন তলে তলে প্রতিবাদ করলেও সামনে লড়েছিলাম আমি একা। আজ তা সংখ্যায় হাজারের উপরে। কথায় আছে চুরের ১০ দিন গিরস্থের ১ দিন। এতদিন সবাই ভিতরে ভিতরে ক্ষেপা থাকলেও আজ প্রকাশ্যে আপনাকে বর্জন করেছে। আপনি আরও পাবেন অপেক্ষায় থাকেন হক সাহেব। আমি ২০১৭ সালে ডিসেম্বরে UI/UX কোর্স করার জন্য শিখবে সবাইতে যাই এবং গিয়ে শিখি UX করে ডেভেলপার এটা আপনাদের কাজ না। ২৪ টা ক্লাসে উনি ক্লাস নিয়েছিলেন মাত্র ৬/৭ টা। ২০ হাজার টাকার কোর্স করার জন্য সিলেট থেকে ভোরে ঢাকা যেতাম আবার বিকেলে ক্লাস করে রাতে ফিরতাম। প্রায় ২৭/২৮ ঘণ্টার জার্নি কষ্ট, আর খরচ তো আছেই। আমি তখনও জানতাম না সিলেটে Rayhan bhai, and Raj da তাদের মতো লোকেরা ছিলেন। এত পরিশ্রম করে যাওয়ার পর যখন ভুলবাল শিখালেন একমাত্র আমিই অন্যায়ের প্রতিবাদ করেছিলাম, পাশে ছিলেন না কেউ। হক সাহেব এবং তাদের মুখোশ উন্মোচন করেছিলাম। আমাকে তখন তার চেলাপেলা প্রচুর আক্রমণও করেছিলেন ফেসবুকে কিন্তু আমি ছিলাম আমার জায়গায়। যেই মানুষটাকে আমি ৫ বছর আগে চাপাবাজ প্রতারক হিসেবে চিনছিলাম আপনারা ৫ বছর পর তাঁকে নিয়ে মুখ খুললেন তাও ভালো লাগলো। যত যাই হোক তিনি আমার শিক্ষক আমি সম্মান করে এত বছর চুপ ছিলাম কিন্তু আপনারা অনেকেই জানেন না তাই জানালাম। তিনি ২০১৮ সালে আমার প্রশ্নের উত্তর দিতে না পেরে ব্লক করেছিলেন এবং শিখবে সবাই গ্রুপ থেকেও ব্যান করেছিলন। খুব কষ্ট পেয়েছিলাম একটা স্টুডেন্ট কমপ্লেইন করছেন তারা সবাই মিলে আমার সাথে যুদ্ধে নেমে গেছিলো কেউ একবার বলে নাই, ভাই কোর্স ঠিক ঠাক না করায় থাকলে আপনি অফিস আসেন আমরা আপনাকে সর্বোচ্চ সহযোগীতা করবো কিন্তু না। তারা আমাকে ভুল প্রমাণ করতে চাইলেন কিন্তু না পেরে ব্লক করেছিলেন। এটা কোন প্রতিষ্ঠানের প্রফেশনালিজমে পরে আমি জানি না। আজও দেখলাম শিখবে সবাইতে আমার ছবি আছে কিন্তু আমাকে কোনদিন সম্মান দিয়ে ডাকা হয়নি, জানতে চাওয়া হয়নি আমি কি বলতে চাই আমার কি নিয়ে সমস্যা ছিলো। তিনি তার নতুন প্রতিষ্ঠানের ছাত্রদের সাথেও এমনটা করেছেন, আজ সবাই তাঁকে নিয়ে গালাগাল দিচ্ছে সত্যি কষ্ট হয়।  দুইটা টা কথা মনে রাখবেন: ১/ দুষ্টুলোকের মিষ্টি কথা। ২/ পাপে বাপেরও ছাড়ে না ।",
                  "image": fakeImage1,
                  "time": 21
            },
            {     
                  "_id": 2,
                  "userPhoto": fakeUser2,
                  "userName": "Arafat Rodro",
                  "post": "এখানে রাসেল কিংবা রিফাত। কে ভালো কিংবা কে খারাপ এইটা আমি জাজ করতে পারবোনা তবে আমি যেটা জাজ করতে পারবো তা হইলো বাংলাদেশের কমিউনিটি খারাপ। সাধারণত একটা লাইভে ১৫০ থেকে ২০০ জন থাকে কিন্তু গতকালের লাইভে ১৫০০+ জন ছিলো। কারণ আমরা টক্সিক জাতি। খুব করে ফাইট দেখতে চাচ্ছিলাম এবং মূলত এটার জন্যই লাইভে ছিলাম ১৫০০+ জন। 1000%+ বুস্ট। আহা।  যায় হোক। রাসেল রে যারা চিনতোনা সেখানে রাসেল বিশাল একটা ফ্যান ফলোয়ার গ্যাইন করলো। আবার অপরদিকে #NFCON2023 এর প্রমোশন টাও হয়ে গেলো। এত বড় একটা আয়োজন। এমন বিশাল কিছু হওয়ার দরকার ছিলো।  তবে আমার দৃষ্টিভজ্ঞি আলাদা। মনে করেন এই কনফারেন্স থেকে ফ্রিল্যান্সিং অফ বাংলাদেশ গ্রুপের এডমিনদের ২০ লক্ষ টাকা প্রফিট। তাতে দোষের কি? তারা যে আয়োজন করতেছে  তাদের পরিশ্রম এবং দক্ষতার একটা মূল্য কি আপনি দিবেন না? ফ্রিতে বন্ধুদের এককাপ চা খাওয়াতে জ্বলে আপনার অপরদিকে তাদেরকে বলতেছেন সবকিছু ফ্রিতে করার জন্য? আমি হইলে ফ্রিতে এত বড় আয়োজন করতাম না। দ্বিতীয়ত, সারাদিন, সারাবছর অজস্র সময় আপনাদের হাতে অথচ শেখার বেলায় ঘোড়ার ডিম আর একদিনের একটা কনফারেন্সে যেয়ে কি শিখবেন এইটা নিয়ে মারামারি শুরু করে দিছেন । তবে আমিও চাচ্ছিলাম আলোচনা গুলো যেন  মোটিভেশনাল হয় এবং স্পিকার গুলো ভালো হয়। যে কথাগুলো দ্বারা আমরা ইন্সপায়ারড হবো । তবে #NFCON2023 এত বড় আয়োজন কিছুটা বাজেভাবে অর্গানাইজ করা হইছে এটার জন্য রাসেলের কিছু পয়েন্ট অনেক যুক্তিসঙ্গত ছিলো। এবং এটা নিয়ে আলোচনার দরকার ছিলো। সর্বশেষ, আপনার পোষায় না আপনি যাবেন না । আপনাকে জোড় করে টিকেট কাটতে বলে নাই কেও । সমালোচনা করুন ভদ্রভাবে। প্রতিবাদ কিভাবে করতে হয় সেটা আমরা জানিনা। টিকেট যদি ১০০ টাও বিক্রি না হইতো তবে কি এর চেয়ে কঠোর প্রতিবাদ আর কিছু ছিলো?  দিনশেষে রাসেল খারাপ রিফাত ভালো কিংবা রিফাত ভালো অথবা রাসেল খারাপ। এই যুক্তিটা লেইম।রিফাত সুযোগ পেলে চেষ্টা করবে তার কোম্পানির প্রমোশন করার অপরদিকে রাসেল আজ একদিনেই এত ফ্যান ফলোয়ার দেখে ৩ টা পোষ্ট করছে । আমি তাদের জায়গায় থাকলে একই কাজ করতাম । নোটঃ রাসেল কিংবা রিফাত এখন পর্যন্ত কারো সাথেই আমার ব্যক্তিগত শত্রুতা কিংবা বন্ধুত্ব নাই। আমি শুধু আমার দৃষ্টিভঙ্গি তুলে ধরলাম ।",
                  "image": fakeImage2,
                  "time": 12
            },
            {     
                  "_id": 3,
                  "userPhoto": fakeUser3,
                  "userName": "Imran Hossain Fahim",
                  "post": "It was a dream! Now it came true!  Alhamdulillah for Everything!",
                  "image": fakeImage3,
                  "time": 19
            },
      ]

      return (
            <main className="w-full">
                  <section className="container px-2 lg:px-96 mx-auto pb-2">
                        {
                              timeLinePosts?.slice(0, 3)?.map(timeline => <TimelinePost timeline={timeline} key={timeline._id}/>)
                        }
                  </section>
            </main>
      );
};

export default TimelinePosts;